p2000t/M2000/src/allegro/Main.c
  //al_save_bitmap("FontBuf.png", FontBuf);
  return 1;
}

#ifdef _WIN32
const wchar_t *GetWideFilename(const char * filename)
{
  static wchar_t _filename_utf16[2*FILENAME_MAX];
  ALLEGRO_USTR *_filename = al_ustr_new(filename);
  al_ustr_encode_utf16(_filename, _filename_utf16, 2*FILENAME_MAX-1);
  al_ustr_free(_filename);
  return _filename_utf16;
}
#endif

void SaveVideoRAM(const char * filename) 
{
  int i;
  FILE *f;
#ifdef _WIN32
  f = _wfopen(GetWideFilename(filename), L"wb");
#else
  f = fopen(filename, "wb");
#endif
  if (f != NULL) {
    // for each of the 24 lines, write 40 chars and skip 40 chars
    for (i=0;i<24;i++)
      fwrite(VRAM + ScrollReg + i*80, 1, 40, f); 
    fclose(f);
  }
}

void OpenCassetteDialog(bool boot) 
{
  FILE *f;
  const char *_cassetteFilePath = NULL;
  al_set_system_mouse_cursor(display, ALLEGRO_SYSTEM_MOUSE_CURSOR_DEFAULT);
  ALLEGRO_FILECHOOSER *cassetteChooser = NULL;
  cassetteChooser = al_create_native_file_dialog(al_path_cstr(userCassettesPath, PATH_SEPARATOR), _(DIALOG_LOAD_CASSETTE), "*.*", 0); //file doesn't have to exist
  if (al_show_native_file_dialog(display, cassetteChooser) && al_get_native_file_dialog_count(cassetteChooser) > 0) {
    _cassetteFilePath = AppendExtensionIfMissing(al_get_native_file_dialog_path(cassetteChooser, 0), ".cas");
    // first try open for update, then try create then try read-only
#ifdef _WIN32
    if ((f = _wfopen(GetWideFilename(_cassetteFilePath), L"r+b")) == NULL) f = _wfopen(GetWideFilename(_cassetteFilePath), L"w+b");
    InsertCassette(_cassetteFilePath, f ? f : _wfopen(GetWideFilename(_cassetteFilePath), L"rb"), (f == NULL));
#else
    if ((f = fopen(_cassetteFilePath,"r+b")) == NULL) f = fopen(_cassetteFilePath, "w+b");
    InsertCassette(_cassetteFilePath, f ? f : fopen(_cassetteFilePath, "rb"), (f == NULL));
#endif
    al_destroy_path(currentTapePath);
    currentTapePath = al_create_path(TapeName);
    UpdateWindowTitle();
    refreshPath(&userCassettesPath, TapeName);
    if (boot)
      WarmReset();
  }
  al_destroy_native_file_dialog(cassetteChooser);
  if (al_get_display_flags(display) & ALLEGRO_FULLSCREEN_WINDOW)
    al_set_mouse_cursor(display, hiddenMouse);
}

void IndicateActionDone() {
  //briefly flash white screen to indicate action was done
  al_clear_to_color(al_map_rgb(255, 255, 255));
  al_flip_display();
  Pause(20);
  RedrawScreen();
}

bool al_key_up(ALLEGRO_KEYBOARD_STATE * kb_state, int kb_event) 
{
  if (!al_key_down(kb_state, kb_event)) return false;
  while (al_key_down(kb_state, kb_event)) al_get_keyboard_state(kb_state);
  return true;
}

void PushKey(byte keyCode)
{
  byte mRow = keyCode / 8;
  byte mCol = 1 << (keyCode % 8);
  if (mRow < 10) KeyMap[mRow] &= ~mCol;
}

void ReleaseKey(byte keyCode)
{
  byte mRow = keyCode / 8;
  byte mCol = 1 << (keyCode % 8);
  if (mRow < 10) KeyMap[mRow] |= mCol;
}

/****************************************************************************/
/*** This function is called at every interrupt to update the P2000       ***/
/*** keyboard matrix and check for special events                         ***/
/****************************************************************************/
void Keyboard(void) 
{
  static byte delayedShiftedKeyPress = 0;
  if (delayedShiftedKeyPress) {
    if (delayedShiftedKeyPress > 100) {
      ReleaseKey(delayedShiftedKeyPress-100);
      ReleaseKey(72); //release LSHIFT
      delayedShiftedKeyPress = 0;
    } else {
      PushKey(delayedShiftedKeyPress);
      delayedShiftedKeyPress += 100;
    }
    return; //stop handling rest of keys
  }

  int i,j,k;
  byte keyPressed;
  bool isCombiKey, isNormalKey, isShiftKey;
  bool isSpecialKeyPressed = 0;
  byte keyCode, keyCodeCombi;
  bool al_shift_down;
  bool isP2000ShiftDown;
  FILE *f;

  ALLEGRO_FILECHOOSER *cartridgeChooser = NULL;
  ALLEGRO_FILECHOOSER *screenshotChooser = NULL;
  ALLEGRO_FILECHOOSER *vRamLoadChooser = NULL;
  ALLEGRO_FILECHOOSER *vRamSaveChooser = NULL;
  ALLEGRO_FILECHOOSER *stateLoadChooser = NULL;
  ALLEGRO_FILECHOOSER *stateSaveChooser = NULL;

  static int pausePressed = 0;
  static bool isNextEvent = false;

  static byte queuedKeys[NUMBER_OF_KEYMAPPINGS] = {0};
  static byte activeKeys[NUMBER_OF_KEYMAPPINGS] = {0};

  //read keyboard state
  al_get_keyboard_state(&kbdstate);
  al_shift_down = al_key_down(&kbdstate,ALLEGRO_KEY_LSHIFT) || al_key_down(&kbdstate,ALLEGRO_KEY_RSHIFT);
  
  static int debugLastKeydown = -1;
  if (Debug) for (i=0;i<256;i++) {
    if (al_key_down(&kbdstate,i)) {
      if (i!=debugLastKeydown) printf("Allegro key down code: %i\n", i);
      debugLastKeydown = i;
    } else if (i==debugLastKeydown) debugLastKeydown = -1;
  }

  if (!al_key_down(&kbdstate,ALLEGRO_KEY_LCTRL) && !al_key_down(&kbdstate,ALLEGRO_KEY_ALT)) {
    if (keyboardmap == 0) {
      /* Positional Key Mapping */
      //fill P2000 KeyMap
      for (i = 0; i < 80; i++) {
        k = i / 8;
        j = 1 << (i % 8);
        if (keymask[i] == ALLEGRO_KEY_UNKNOWN)
          continue;
        if (al_key_down(&kbdstate, (keymask[i] & 0xff)) || (keymask[i] && al_key_down(&kbdstate, (keymask[i] >> 8)))) {
          KeyMap[k] &= ~j;
#ifdef __APPLE__
          OSX_COMMAND_KEY_FIX
#endif
#ifdef _WIN32
          keyPressed = keymask[i] & 0xff;
          WINDOWS_NUM_KEY_FIX
#endif
        }
        else
          KeyMap[k] |= j;  
      }
    }
    else {
      /* Symbolic Key Mapping */
      isP2000ShiftDown = (~KeyMap[9] & 0xff) ? 1 : 0; // 1 when one of the shift keys is pressed
      for (i = 0; i < NUMBER_OF_KEYMAPPINGS; i++) {
        keyPressed = keyMappings[i][0];
        isCombiKey = keyMappings[i][1] != keyMappings[i][3];
        isNormalKey = !isCombiKey && (keyMappings[i][2] == 0) && (keyMappings[i][4] == 1);
        isShiftKey = keyMappings[i][al_shift_down ? 4 : 2];
        keyCode = keyMappings[i][al_shift_down ? 3 : 1];
        keyCodeCombi = isCombiKey ? keyMappings[i][al_shift_down ? 1 : 3] : -1;

        if (queuedKeys[i] || al_key_down(&kbdstate, keyPressed)) {
          if (isCombiKey) 
            ReleaseKey(keyCodeCombi);
          if (isNormalKey || (isShiftKey == isP2000ShiftDown)) {
            queuedKeys[i] = 0;
            PushKey(keyCode);
          } else {
            // first, the shift must be pressed/un-pressed in this interrupt
            // then in the next interrupt the target key itself will be pressed
            KeyMap[9] = isShiftKey ? 0xfe : 0xff; // 0xfe = LSHIFT
            queuedKeys[i] = 1;
          }
          activeKeys[i] = 1;
#ifdef __APPLE__
          OSX_COMMAND_KEY_FIX
#endif
#ifdef _WIN32
          WINDOWS_NUM_KEY_FIX
#endif
          if (!isNormalKey) 
            isSpecialKeyPressed = true;
        } else if (activeKeys[i]) {
          // unpress key and second key in P2000's keyboard matrix
          if (isCombiKey) ReleaseKey(keyCodeCombi);
          ReleaseKey(keyCode);
          activeKeys[i] = 0;
        }
      }
      if (!isSpecialKeyPressed) {
        if (al_key_down(&kbdstate,ALLEGRO_KEY_LSHIFT)) KeyMap[9] &= ~0b00000001; else KeyMap[9] |= 0b00000001;
        if (al_key_down(&kbdstate,ALLEGRO_KEY_RSHIFT)) KeyMap[9] &= ~0b10000000; else KeyMap[9] |= 0b10000000;
        if (al_key_down(&kbdstate,ALLEGRO_KEY_CAPSLOCK)) KeyMap[3] &= ~0b00000001; else KeyMap[3] |= 0b00000001;
      }
    }
  }

