p2000t/M2000/src/allegro/Main.c
  // Ctrl-1           -  START key (start loaded program)
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && (al_key_up(&kbdstate, ALLEGRO_KEY_1) || al_key_up(&kbdstate, ALLEGRO_KEY_PAD_1))) {
    PushKey(72); //LSHIFT
    delayedShiftedKeyPress = 56;
  }
  // Ctrl-2           -  STOP key (pause/halt program)
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && (al_key_up(&kbdstate, ALLEGRO_KEY_2) || al_key_up(&kbdstate, ALLEGRO_KEY_PAD_2))) {
    PushKey(72); //LSHIFT
    delayedShiftedKeyPress = 16;
  }
  // Ctrl-3           -  ZOEK key (show cassette index)
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && (al_key_up(&kbdstate, ALLEGRO_KEY_3) || al_key_up(&kbdstate, ALLEGRO_KEY_PAD_3))) {
    PushKey(72); //LSHIFT
    delayedShiftedKeyPress = 59;
  }
  // Ctrl-0           -  WIS key (clear cassette)
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && (al_key_up(&kbdstate, ALLEGRO_KEY_0) || al_key_up(&kbdstate, ALLEGRO_KEY_PAD_0))) {
    PushKey(72); //LSHIFT
    delayedShiftedKeyPress = 51;
  }

  // Ctrl-I           -  Insert cassette dialog
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_I) && al_key_up(&kbdstate, ALLEGRO_KEY_LCTRL))
    OpenCassetteDialog(false);

  // Ctrl-O           -  Boot Cassette dialog
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_O) && al_key_up(&kbdstate, ALLEGRO_KEY_LCTRL))
    OpenCassetteDialog(true);

  // Ctrl-E           -  Eject current cassette
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_E)) {
    al_destroy_path(currentTapePath);
    currentTapePath = NULL;
    RemoveCassette();
    UpdateWindowTitle();
  }

  // Ctrl-R           -  Reset P2000
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_R))
    WarmReset();

  // Ctrl-T           -  Interrupt P2000 (NMI)
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_T))
    NMI = 1;

  // Ctrl-Enter       -  Toggle fullscreen on/off (not supported on Linux)
  if ((al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) || al_key_down(&kbdstate, ALLEGRO_KEY_ALT)) && al_key_up(&kbdstate, ALLEGRO_KEY_ENTER))
    ToggleFullscreen();

  // Ctrl-L           -  Toggle scanlines on/off
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_L)) {
    scanlines = !scanlines;
    RedrawScreen();
  }

  // Ctrl-Q           -  Quit emulator
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_Q))
    Z80_Running = 0;

  // Ctrl-C           -  Save current state to file (without dialog)
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_C)) {
    SaveState(NULL, userSavestatesPath);
    IndicateActionDone();
  }

  // Ctrl-V           -  Load previously saved state (without dialog)
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_V))
    LoadState(NULL, userSavestatesPath);

  // Ctrl-S           -  Save screenshot to file (without dialog)
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_S)) {
    static char extension[25];
    time_t now = time(NULL);
    strftime(extension, 25, " %Y-%m-%d %H-%M-%S.png", localtime(&now));
    al_set_path_filename(userScreenshotsPath, currentTapePath ? al_get_path_filename(currentTapePath) : "Screenshot");
    al_set_path_extension(userScreenshotsPath, extension);
    SaveScreenshotToFile(al_path_cstr(userScreenshotsPath, PATH_SEPARATOR));
    al_set_path_filename(userScreenshotsPath, NULL);
    IndicateActionDone();
  }

  // Ctrl-D           -  Dump visible video RAM to file (without dialog)
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_D)) {
    static char extension[26];
    time_t now = time(NULL);
    strftime(extension, 26, " %Y-%m-%d %H-%M-%S.vram", localtime(&now));
    al_set_path_filename(userVideoRamDumpsPath, currentTapePath ? al_get_path_filename(currentTapePath) : "VideoRAM");
    al_set_path_extension(userVideoRamDumpsPath, extension);
    SaveVideoRAM(al_path_cstr(userVideoRamDumpsPath, PATH_SEPARATOR));
    al_set_path_filename(userVideoRamDumpsPath, NULL);
    IndicateActionDone();
  }
  
  // Ctrl-P           -  Toggle pause on/off
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_P)) {
    pausePressed = !pausePressed;
    al_set_menu_item_flags(menu, SPEED_PAUSE, pausePressed ? ALLEGRO_MENU_ITEM_CHECKED : ALLEGRO_MENU_ITEM_CHECKBOX);
  }

  // Ctrl-M           -  Toggle mute/unmute
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_M)) {
    soundmode = !soundmode;
    al_set_menu_item_flags(menu, OPTIONS_SOUND_ID, soundmode ? ALLEGRO_MENU_ITEM_CHECKED : ALLEGRO_MENU_ITEM_CHECKBOX);
  }

  // handle joystick
  if (joymode && joyDetected) {
    al_get_joystick_state(joystick, &joyState);
    for (i = 0; i < 5; i++) { // 4 directions and 1 button
      if ((i < 4 && joyState.stick[0].axis[i%2]*(-2.0*(i/2)+1.0) > 0.5) ||
          (i == 4 && joyState.button[0])) {
        PushKey(joyKeyMapping[joymap][i]);
        lastJoyState[i] = 1;
      }
      else {
        if (lastJoyState[i]) ReleaseKey(joyKeyMapping[joymap][i]);
        lastJoyState[i] = 0;
      }
    }
  } 
}

/****************************************************************************/
/*** Pauses a specified ammount of milliseconds                           ***/
/****************************************************************************/
void Pause(int ms) 
{
  al_rest((double)ms / 1000.0);
}

void DrawTileScanlines(int tileX, int tileY) 
{
  float i;
  float vpixel = DisplayTileHeight/30.0;
  ALLEGRO_COLOR evenLineColor = al_map_rgba(0, 0, 0, 50);
  ALLEGRO_COLOR scanlineColor = al_map_rgba(0, 0, 0, 120);
  for (i=DisplayVBorder+tileY*DisplayTileHeight; i<DisplayVBorder+(tileY+1)*DisplayTileHeight; i+=3.0*vpixel)
  {
    al_draw_line(DisplayHBorder + tileX*DisplayTileWidth, i+0.45*vpixel, DisplayHBorder + (tileX+1)*DisplayTileWidth, i+0.45*vpixel, scanlineColor, vpixel);
    al_draw_line(DisplayHBorder + tileX*DisplayTileWidth, i+2.45*vpixel, DisplayHBorder + (tileX+1)*DisplayTileWidth, i+2.45*vpixel, evenLineColor, vpixel);
  }
}

