p2000t/M2000/src/allegro/Main.c
/****************************************************************************/
/*** This function is called by the screen refresh drivers to copy the    ***/
/*** off-screen buffer to the actual display                              ***/
/****************************************************************************/
void PutImage (void)
{
  al_flip_display();
}

/****************************************************************************/
/*** Put a character in the display buffer for P2000T emulation mode      ***/
/****************************************************************************/
void PutChar(int x, int y, int c, int fg, int bg, int si)
{
  static byte PrevColumnMode = 0;
  int K = c + (fg << 8) + (bg << 16) + (si << 24);
  int cols = ColumnModeReg ? 80 : 40;

  // Clear display cache when switching between 40 and 80 column modes
  if (ColumnModeReg != PrevColumnMode) {
    RedrawScreen();
    DisplayTileWidth = DisplayWidth / (ColumnModeReg ? 80 : 40);
    PrevColumnMode = ColumnModeReg;
  }

  if (K == charBuffer[y * cols + x])
    return;
  charBuffer[y * cols + x] = K;

  if (c > 0 && Debug) {
    printf("PutChar (%i,%i,%i,%i,%i,%i);\n", x, y, c, fg, bg, si);
  }

  al_set_target_bitmap(al_get_backbuffer(display));
  al_draw_tinted_scaled_bitmap(
    smoothing ? smFontBuf : FontBuf,
    al_map_rgba(Pal[fg * 3], Pal[fg * 3 + 1], Pal[fg * 3 + 2], 255), 
    c * (CHAR_TILE_WIDTH + CHAR_TILE_SPACE), (si >> 1) * CHAR_TILE_HEIGHT/2, 
    CHAR_TILE_WIDTH, si ? CHAR_TILE_HEIGHT/2 : CHAR_TILE_HEIGHT,
    DisplayHBorder + x * DisplayTileWidth, DisplayVBorder + y * DisplayTileHeight,
    DisplayTileWidth, DisplayTileHeight, 0);
  if (bg)
    al_draw_tinted_scaled_bitmap(
      smoothing ? smFontBuf_bk : FontBuf_bk,
      al_map_rgba(Pal[bg * 3], Pal[bg * 3 + 1], Pal[bg * 3 + 2], 0), 
      c * (CHAR_TILE_WIDTH + CHAR_TILE_SPACE), (si >> 1) * CHAR_TILE_HEIGHT/2, 
      CHAR_TILE_WIDTH, si ? CHAR_TILE_HEIGHT/2 : CHAR_TILE_HEIGHT,
      DisplayHBorder + x * DisplayTileWidth, DisplayVBorder + y * DisplayTileHeight,
      DisplayTileWidth, DisplayTileHeight, 0);
  if (scanlines) DrawTileScanlines(x, y);
}

char *GetResourcesPath() 
{
  strcpy (ProgramPath, al_path_cstr(al_get_standard_path(ALLEGRO_RESOURCES_PATH), PATH_SEPARATOR));

  // debian install check
  if (!strcmp(ProgramPath,"/usr/bin/"))
    strcpy(ProgramPath, "/usr/share/M2000/");

  return ProgramPath;
}

char *GetDocumentsPath() 
{
  strcpy(DocumentPath, GetResourcesPath()); //fallback to program path
  ALLEGRO_PATH *docPath = al_get_standard_path(ALLEGRO_USER_DOCUMENTS_PATH);
  if (docPath) {
    al_append_path_component(docPath, "M2000");
    if (al_make_directory(al_path_cstr(docPath, PATH_SEPARATOR)))
      strcpy(DocumentPath, al_path_cstr(docPath, PATH_SEPARATOR));
    al_destroy_path(docPath);
  }
  return DocumentPath;
}

int main(int argc,char *argv[]) 
{
  if (!al_init()) { ShowErrorMessage("Allegro could not initialize its core."); return EXIT_FAILURE; }
  if (!al_init_primitives_addon()) { ShowErrorMessage("Allegro could not initialize primitives addon."); return EXIT_FAILURE; }
  if (!al_init_image_addon()) { ShowErrorMessage("Allegro could not initialize image addon."); return EXIT_FAILURE; }
  if (!al_init_native_dialog_addon()) { ShowErrorMessage("Allegro could not initialize native dialog addon."); return EXIT_FAILURE; }
  if (!al_install_keyboard()) { ShowErrorMessage("Allegro could not install keyboard."); return EXIT_FAILURE; }

  /* create M2000 folder inside user's Documents folder */
  docPath = al_get_standard_path(ALLEGRO_USER_DOCUMENTS_PATH);
  al_append_path_component(docPath, "M2000");
  if (!al_make_directory(al_path_cstr(docPath, PATH_SEPARATOR))) { 
    ShowErrorMessage("Can't create documents folder %s.", al_path_cstr(docPath, PATH_SEPARATOR)); 
    return EXIT_FAILURE; 
  }

  InitConfig();
  if (Verbose) {
    uint32_t version = al_get_allegro_version();
    printf("Using Allegro libs version %i.%i.%i\n",version >> 24, (version >> 16) & 255, (version >> 8) & 255);
  }
  int result = M2000_main(argc, argv);
  al_uninstall_system();
  return result;
}
